In [268]:
import matplotlib.pyplot as plt 
import pandas as pd 
import numpy as np
#import seaborn as sb
import json as js
var= {}

var["srinath"]= {
    "name" : " sri", " mobile No." : 2377623 , " location " : "pollachi"
}
var["op"]= {
    "name" : " op", " mobile No." : 342324 , " location " : "cbe"
}

In [269]:
type(var)

dict

In [270]:
#the below func converts the dict to string
s=js.dumps(var)
type(s)

str

In [271]:
with open("C:\data\srinathjson.txt","w") as f:
    f.write(s)
    # alternative f=open(" file path ","w")
    # f.write(" var naem that should be str")

In [272]:
with open("C:\data\srinathjson.txt","r") as f:
    a=f.read()

In [ ]:
import json
f = open("C:\data\srinathjson.txt","w+")
phone_book = {}
command = ""
while command != 'exit':
    command = input('Enter a command(options: new,get,save): ')
    if command == "new":
        name = input('Enter name of the person')
        p = input('Phone number: ')
        a = input('Address: ')
        phone_book[name] = {'phone': p, 'address': a}
    elif command == 'get':
        name = input('Enter name of the person')
        if name in phone_book:
            print(phone_book[name])
        else:
            print('person not found in address book')
    elif command == 'save':
        f.write(json.dumps(phone_book))

Enter a command(options: new,get,save): new
Enter name of the personsrinath
Phone number: 464564
Address: fdgashfgd
Enter a command(options: new,get,save): save

In [273]:
a

'{"srinath": {"name": " sri", " mobile No.": 2377623, " location ": "pollachi"}, "op": {"name": " op", " mobile No.": 342324, " location ": "cbe"}}'

In [274]:
type(a)

str

In [275]:
b=js.loads(a)

In [276]:
b

{'srinath': {'name': ' sri', ' mobile No.': 2377623, ' location ': 'pollachi'},
 'op': {'name': ' op', ' mobile No.': 342324, ' location ': 'cbe'}}

In [277]:
type(b)

dict

In [278]:
df=pd.DataFrame(b)

In [279]:
df

              srinath      op
name              sri      op
 mobile No.   2377623  342324
 location    pollachi     cbe

In [280]:
df["op"][" location "]

'cbe'

In [281]:
df=df.replace("cbe","0")

In [282]:
df=df.replace("pollachi",np.NaN)

In [283]:
df

             srinath      op
name             sri      op
 mobile No.  2377623  342324
 location        NaN       0

In [284]:
type(df["srinath"][" location "]),type(df["op"][" location "])

(float, str)

In [285]:
df.isnull()

             srinath     op
name           False  False
 mobile No.    False  False
 location       True  False

In [286]:
df.dropna()

             srinath      op
name             sri      op
 mobile No.  2377623  342324

In [287]:
df.fillna("0")

             srinath      op
name             sri      op
 mobile No.  2377623  342324
 location          0       0

In [288]:
#df.interpolate(method='linear')

In [289]:
type(df['srinath'])

pandas.core.series.Series

In [290]:
#new data set
data = {
    'name': ['srinath', 'op'],
    'mobile No.': ['2377623', '342324'],
    'location': ['0', '0']
}
df_new = pd.DataFrame(data)

In [291]:
df_new['name']

0    srinath
1         op
Name: name, dtype: object

In [292]:
df_new.set_index("name",inplace = True)

In [293]:
df_new

        mobile No. location
name
srinath    2377623        0
op          342324        0

In [294]:
df_new.index

Index(['srinath', 'op'], dtype='object', name='name')

In [295]:
lst = ['a', 'b', 'c']

In [296]:
df_new.reindex(method='ffill')

        mobile No. location
name
srinath    2377623        0
op          342324        0

In [297]:
df_new

        mobile No. location
name
srinath    2377623        0
op          342324        0

In [298]:
df_new['location'][1]

'0'

In [306]:
print(df_new.index.tolist()) # lsit type

['srinath', 'op']

In [307]:
print(df_new.index.values) # nd array type

['srinath' 'op']